In [15]:
!pip list

Package           Version
----------------- -------
asttokens         2.2.1
backcall          0.2.0
colorama          0.4.6
comm              0.1.3
debugpy           1.6.7
decorator         5.1.1
executing         1.2.0
ipykernel         6.23.1
ipython           8.13.2
jedi              0.18.2
jupyter_client    8.2.0
jupyter_core      5.3.0
matplotlib-inline 0.1.6
nest-asyncio      1.5.6
numpy             1.25.1
packaging         23.1
pandas            2.0.3
parso             0.8.3
pickleshare       0.7.5
platformdirs      3.5.1
prompt-toolkit    3.0.38
psutil            5.9.5
pure-eval         0.2.2
Pygments          2.15.1
python-dateutil   2.8.2
pytz              2023.3
pywin32           306
pyzmq             25.0.2
six               1.16.0
stack-data        0.6.2
tornado           6.3.2
traitlets         5.9.0
tzdata            2023.3
wcwidth           0.2.6

[notice] A new release of pip available: 22.3.1 -> 23.2.1
[notice] To update, run: C:\Users\김근수\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [16]:
import pandas as pd

In [19]:
df = pd.read_csv('pandas/data/friend_list.csv')

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [27]:
df.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [29]:
df = pd.read_csv('pandas/data/friend_list.txt')

In [31]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [33]:
df = pd.read_csv('pandas/data/friend_list_tab.txt')

In [35]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [47]:
df = pd.read_csv('pandas/data/friend_list_tab.txt', delimiter= '\t')

In [49]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [51]:
df = pd.read_csv('pandas/data/friend_list_no_head.csv')

In [52]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [54]:
df = pd.read_csv('pandas/data/friend_list_no_head.csv', header=None)

In [56]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [58]:

df.columns = ['name','age', 'job']

In [60]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [62]:
df = pd.read_csv('pandas/data/friend_list_no_head.csv', header=None, names = ['name','age','job'])

In [63]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern